var should = require('should'),
    fmt = require('../rssi')

describe('utf8', function () {
    it('should support Unicode', function () {
        var fn = fmt('#{ленин}, #{партия}, #{комсомол}')

        fn({ололо: 'ололо'}).should.equal('#{ленин}, #{партия}, #{комсомол}')
        fn({ленин: 'Ленин'}).should.equal('Ленин, #{партия}, #{комсомол}')
        fn({ленин: 'Путин — краб',
            партия: 'Единая★Россия',
            комсомол: 'самодержавие и духовность'}).should.equal('Путин — краб,' +
                ' Единая★Россия, самодержавие и духовность')
    })
})
